[
  {
    "id": 3,
    "post_id": "eoizo1",
    "url": "https://www.reddit.com/r/Alzheimers/comments/eoizo1/hello_need_your_opinion/",
    "text": "Hello! My name is Ann.\nMy team and me are working on a 3-headed electric toothbrush which effectively cleans teeth without any complicated movements needed. We plan to adapt it for people with special needs and eldery health issues. \nToothbrush concept: \n1. It cleans teeth without any efforts and complicated proper movements, because the toothbrush has 3 heads, that cover the tooth from all sides at the right angle and with the right pressure. You just need to move it from tooth to tooth. \n2. Since the brush cleans immediately 3 sides of the tooth, it cleans much faster.\nIf you have any info about what should we take into account to make the toothbrush as effective as possible for people with special needs, please, click on the link below to answer some questions. I would highly appreciate if you could help us.\nhttps://jedibrush.com/special_form",
    "author": "Ann_Zolotoreva",
    "title": "Hello! Need your opinion!",
    "create_time": 1578993515,
    "source": "Alzheimers"
  },
  {
    "id": 4,
    "post_id": "eoc4jo",
    "url": "https://www.reddit.com/r/Alzheimers/comments/eoc4jo/how_to_motivate_my_grammy/",
    "text": "Hey everyone, I'm 22 and new here. My Grammy is about stage 5-6, and my family (me, my husband, and our two young kids) have just moved back to my hometown so I can be the caretaker for my grandparents, mostly my Grammy who is 82. She lives at home with my grandfather, they've been married 60+ years and up until this point he's been able to do most everything for her himself. \nI come over everyday now, about 6-7 hours a day, to help with meals, housework, activities etc. But I'm at a bit of a loss! My Grammy was an avid quilter, loved to crochet, scrapbook, make cards... But I can't get her to do anything! She isn't interested at all in any of those things or even anything in that area. She just wants to sit in her chair. Occasionally she'll read her Guideposts, or watch the Price is Right, but I'm really struggling getting her to do things. I don't want to push her too hard as she can get very testy, but I know it would be good for her to engage in an activity of some sort. \nAny thoughts?",
    "author": "unsungtoaster85",
    "title": "How to motivate my Grammy",
    "create_time": 1578956921,
    "source": "Alzheimers"
  },
  {
    "id": 6,
    "post_id": "eo539k",
    "url": "https://www.reddit.com/r/Alzheimers/comments/eo539k/advice_on_how_to_speak_to_my_mom/",
    "text": "My 71 year old mother has been dealing with Alzheimer's for many years. I've been bathing her about a year now. Dad turns off gas and locks doors ( supplying details to give a frame of reference ).\nShe often talks about going home to check on her parents (gone for 20 years) or kids (I'm her youngest at 34 years old) or whatever. She yells at my dad to take her home all the while saying their current home  is actually her house her dad got for her (it isn't).\nWe are managing, but what's best to say to her? When she pleads to me to pick her up and take her home? Most if the time, I can change the topic and she forgets eventually, but sometimes she gets fixated. Do I go pick her up and drive around? Do I gently remind her she is home? Do I just listen? What's best in your experiences?",
    "author": "TheJourneyOfJen",
    "title": "Advice on how to speak to my Mom",
    "create_time": 1578927103,
    "source": "Alzheimers"
  },
  {
    "id": 7,
    "post_id": "emf13f",
    "url": "https://www.reddit.com/r/Alzheimers/comments/emf13f/how_to_keep_my_moms_money_safe_from_her/",
    "text": "We have reached a point where mom is so confused she forgets where money is and then goes to the bank for more. Yesterday she took out several thousand dollars and hid it somewhere, which she won't tell me where because she is starting to not trust anyone. So it's time to make her accounts inaccessible, i just don't know how to do it and still have her SS and pension checks go into them. How did you guys do it? I am her POA so that's not a problem.",
    "author": "GGLaura",
    "title": "How to keep my mom's money safe from her",
    "create_time": 1578600096,
    "source": "Alzheimers"
  },
  {
    "id": 9,
    "post_id": "em1qqr",
    "url": "https://www.reddit.com/r/Alzheimers/comments/em1qqr/showers_are_getting_less_and_less_frequent_for_my/",
    "text": "I've been living with my grandfather for 4 months as his caregiver. When I moved in he would take 1 or 2 showers per week, but now I'm lucky if I get him to take one once every 2 weeks. I'm sure this is a common problem in this community (I'm very new at this lol), and was wondering if anyone had success with certain strategies. Mine is that I don't let him know how bad he smells but I will make comments like \"man what a beautiful night for a nice hot shower huh?\" And he always likes the idea of a shower, but getting him in there is difficult. It's getting embarrassing to take him out in public",
    "author": "MysteryHau5",
    "title": "Showers are getting less and less frequent for my grandpa. Anyone have any great tips to get him in the tub?",
    "create_time": 1578530020,
    "source": "Alzheimers"
  },
  {
    "id": 12,
    "post_id": "ej45ni",
    "url": "https://www.reddit.com/r/Alzheimers/comments/ej45ni/enjoyable_activities/",
    "text": "Hi everyone. We lost my grandma to alzheimer’s last December and now my grandpa is progressing into mid/late stage alzheimer’s as well. He is extremely bored all the time and I want to find things for him to do. Right now he pretty much just watches tv. The problem is we have gotten him word searches (his favorite pre-alz), easy puzzles, simple games, etc but he refuses to use them. \nHe is very stubborn and still lucid a lot of the time, so things that are too “childish” like busy boxes offend him. He is also still struggling a lot with not being able to drive. \nI feel helpless because every time we talk he brings up the fact that he is so bored and can’t do anything. Does anyone have any ideas how I can help? I live on the other side of the country so just visiting more isn’t currently an option. \n(Background info: he is about to be 87,  formerly a mechanic and handy man, mid-late stage alz, and lives in a small nursing home with round the clock care.)",
    "author": "coffeeeprincess",
    "title": "Enjoyable activities?",
    "create_time": 1577998618,
    "source": "Alzheimers"
  },
  {
    "id": 13,
    "post_id": "eil1a8",
    "url": "https://www.reddit.com/r/Alzheimers/comments/eil1a8/what_do_you_do_to_keep_someone_with_alzheimers/",
    "text": "Hi all, what do you guys do to keep an alzheimers person busy/interested/occupied? I know my family member does not seems phased my TV or music anymore. Also a lot of things you give her she wants to eat. I try to talk with her. I wish there was something I could give her to play with. I'm not sure if I am describing this best but any idears would be great.",
    "author": "Darthmambo",
    "title": "What do you do to keep someone with alzheimers busy/interested?",
    "create_time": 1577900395,
    "source": "Alzheimers"
  },
  {
    "id": 14,
    "post_id": "eibp3c",
    "url": "https://www.reddit.com/r/Alzheimers/comments/eibp3c/help_with_grandmas_pills/",
    "text": "Hi, I’m not sure if this is the right place to ask. I’ve been taking care of my grandma for the last 4 months. Her Alzheimers gets a little bit worse everyday, but so far we’ve managed. \nToday I noticed she doesn’t remember who I am anymore, that hurts like nothing else I felt before, but my main concern right now is that I can’t make her to take her pills.\nI think maybe she doesn’t trust me since I am now a stranger. (?)\nAny advice would be great.\nHappy new year everyone.",
    "author": "Srt101b",
    "title": "Help with grandma’s pills",
    "create_time": 1577840157,
    "source": "Alzheimers"
  },
  {
    "id": 15,
    "post_id": "egyl8q",
    "url": "https://www.reddit.com/r/Alzheimers/comments/egyl8q/beware_of_hidden_upgrades_that_cost_big/",
    "text": "Just learn I need to use parental controls on the tv. My mom has Alzheimers, my stepfather is able to care for in their home and I try to support them both. My stepfather called me upset that their cable bill was $60 more than normal. When he called, he was told they upgrade plans. He argued with them and they took off the charges. I followed up to see why they were upgraded to the next package. The cable clerk explained that if you click on a channel not in your plan, the system prop asks if you'd like to upgrade by clicking again. This is what happened and between my mom and my stepfather, who struggles with the tv remote, I'm surprised it hasn't happened before. The clerk explained I could fix the upgrade prop with parental control options. Please check your tv, this is such an easy mistake for those with Alzheimers (and even without)!",
    "author": "JennH19",
    "title": "Beware of hidden upgrades that cost big",
    "create_time": 1577578364,
    "source": "Alzheimers"
  },
  {
    "id": 16,
    "post_id": "egtlyt",
    "url": "https://www.reddit.com/r/Alzheimers/comments/egtlyt/looking_for_recommendations/",
    "text": "Hi everyone, \nI’m looking for some advice. My grandma who has dementia/alzheimer’s ( not exactly sure)  lives with my grandpa alone together. He is her main caregiver, although she doesn’t recognize that he is her husband ( she thinks they WERE married at some point but not now ) and that she isn’t in her home. She will try and walk out the door to “walk and find her house”. My mother and I don’t live with them but we are close, we use a ring doorbell to see when she tries to leave and go over to help intervene although grandpa is usually able to handle it. My fear is that one day nobody will notice that shes left and we won’t be able to find her. \nThe thing is that she always takes her purse with her, does anyone know of a GPS tracker that doesn’t need to be charged too often and works well, maybe that is compatible with an app. All suggestions are welcome. \nThanks in advance!",
    "author": "KatieVBa",
    "title": "Looking for recommendations",
    "create_time": 1577554918,
    "source": "Alzheimers"
  },
  {
    "id": 18,
    "post_id": "eerh2x",
    "url": "https://www.reddit.com/r/Alzheimers/comments/eerh2x/kind_of_late_but_what_are_some_good_christmas/",
    "text": "My mom forgets about gift cards so they never get used, and the place she lives feeds her more than she could ever eat so food is no good. We just spent 2 years liquidating and estate selling most of her stuff so I don't want to get her clutter. I have spent months trying to think of something and I'm having trouble coming up with anything. So what did you get your loved one with AD?",
    "author": "Minemose",
    "title": "Kind of late, but what are some good Christmas gifts for Alzheimer's patients?",
    "create_time": 1577139122,
    "source": "Alzheimers"
  },
  {
    "id": 20,
    "post_id": "ed1ltv",
    "url": "https://www.reddit.com/r/Alzheimers/comments/ed1ltv/gently_correct_my_grandma_or_allow_her_to_believe/",
    "text": "Hi all! My grandma is starting to lose her memory (and I believe was told that she is developing Alzheimers, but I'm not sure). Anyway, what do I do? Should I correct her? She never says she doesn't remember things, she just says things that are untrue with regards to recent, current events, and often forgets the year. For instance she thought she was 75 and not 86. She thought my brother was turning 17. He was 21. She says she didn't vote when she did. It was the week after the election. She said she hasn't been to the special exhibition at a museum. My mother took her there the week before. \nI always just let the moment pass and agree with her, i.e. 'Yes, it's a very interesting exhibition, you should go, I know you like that sort of stuff.' \nMy mum on the other hand is like:\n' Remember we went last week? We went together and you said xyz.'\nWhich approach is correct? She means a lot to me, and it pains me to see this happening to her. This is a terrible disease. The only plus side I see is that it's happening so late in life and that she had 86 good years. :)",
    "author": "JustinianusI",
    "title": "Gently correct my grandma or allow her to believe what she wishes?",
    "create_time": 1576798986,
    "source": "Alzheimers"
  },
  {
    "id": 21,
    "post_id": "ebljl9",
    "url": "https://www.reddit.com/r/Alzheimers/comments/ebljl9/gift_ideas_for_person_with_late_stage_alzheimers/",
    "text": "Hey everyone. I’m here to look for a little support for how to best connect with my grandma (69yo) before she passes. She was diagnosed with Alzheimer’s a few years ago, but had a recent steep decline. Over the past few months, she has been in the hospital for erratic behavior and they think that she had several strokes while in the hospital (possibly due to psych meds, but that’s another story).\nShe’s now on hospice and can’t talk anymore. Last time I saw her, she only seems to acknowledge others around her sometimes, often staring off into nothing for a while. She can’t feed herself or go to the bathroom by herself. I live a few states away, but have been trying hard to see her at least once a month. I worry every time I see her will be the last.\nSo Christmas has always been very important to her. I feel bad not getting her anything, but I don’t know what might be appropriate for her. I thought of baking her something because we did that together, but I’ve been told she isn’t eating much. I always did crafts with her, but I can’t think of anything to make. It doesn’t have to be a gift, either, but maybe something I can do with her.",
    "author": "routevegetable",
    "title": "Gift ideas for person with late stage Alzheimer’s and history of strokes",
    "create_time": 1576531999,
    "source": "Alzheimers"
  },
  {
    "id": 23,
    "post_id": "e9dpkh",
    "url": "https://www.reddit.com/r/Alzheimers/comments/e9dpkh/advice_on_watches_to_track_loved_ones/",
    "text": "My grandfather is currently in the early stages of Alzheimers. He is still living in a home with my grandmother, but we would like to purchase him something similar to a fitbit just in case. He currently wears a fitbit daily and charges it nightly. I am looking at an apple watch with a data plan, but didnt know if there were better options. He does not ever carry his phone with him so we need something outside of just phone tracking",
    "author": "Callsignraven",
    "title": "Advice on watches to track loved ones?",
    "create_time": 1576100550,
    "source": "Alzheimers"
  },
  {
    "id": 28,
    "post_id": "e9cc68",
    "url": "https://www.reddit.com/r/Alzheimers/comments/e9cc68/does_anybody_have_some_cabinet_lock/",
    "text": "I'm just at a complete loss right now. My MIL ate a week's worth of groceries in 2 days. She then proceeded to eat my personal groceries as well, so well over $100 in less than half a week. I'm not making enough money for all of this, and the next few weeks are now probably going to be rice & beans to stretch it out. My partner is trying, but it's been like feeding a black hole, she sneaks down in the middle of the night and cleans the place out. \nI'm just at a complete loss right now. My MIL ate a week's worth of groceries in 2 days. She then proceeded to eat my personal groceries as well, so well over $100 in less than half a week. I'm not making enough money for all of this, and the next few weeks are probably going to be rice & beans to stretch it out. \nEither way, are there any locks that you'd recommend? We've decided to lock all of the cupboards and the fridge, leaving her snack cabinet open with her food for the day.",
    "author": "chingu_not_gogi",
    "title": "Does anybody have some cabinet lock recommendations?",
    "create_time": 1576094853,
    "source": "Alzheimers"
  },
  {
    "id": 29,
    "post_id": "e8yls8",
    "url": "https://www.reddit.com/r/Alzheimers/comments/e8yls8/my_grandmother_has_lived_in_the_same_house_for_57/",
    "text": "She is in the late stages of alzheimers, and every night she asks me \"Have you ever been here before?\" And I say of course and explain to her that we are still in the town we have lived in for over half a decade, which just confuses her and then she will ask again in a minute or two.\nMy question is what can I do to make her realize that she is home?",
    "author": "JizzGenie",
    "title": "My grandmother has lived in the same house for 57 years, and now she is convinced that we've moved to a house \"down the shore\"",
    "create_time": 1576020233,
    "source": "Alzheimers"
  },
  {
    "id": 32,
    "post_id": "e8x7of",
    "url": "https://www.reddit.com/r/Alzheimers/comments/e8x7of/are_there_any_devicesservices_that_only_allow/",
    "text": "My mom has early stage Alzheimer’s and has already been the victim of one scammer. I need something that will automatically send any unknown, untrusted numbers to voicemail. \nI’ve found the “Sentry” product online but it seems too easy to get around by pressing 0 and then calling back. \nThere’s no reason for my mom to pick up a call from an unknown caller at this point. \nAny ideas?",
    "author": "sokpuppet1",
    "title": "Are there any devices/services that only allow whitelisted numbers through and send everything else to voicemail?",
    "create_time": 1576014032,
    "source": "Alzheimers"
  },
  {
    "id": 34,
    "post_id": "e8nana",
    "url": "https://www.reddit.com/r/Alzheimers/comments/e8nana/i_know_its_always_said_to_never_argue_with/",
    "text": "I've said he doesn't (which is the truth). But then she insists he does. I ask how she knows and she just says that she knows he is with her. She has said it to me and to my stepdad in person. I know I am not supposed to argue or disagree, but I can't fathom just saying \"oh well,\" when she says stuff like that.",
    "author": "boredAZhell",
    "title": "I know it's always said to never argue with someone with Alzheimer's, but how do we approach it when my mom insists that my stepdad has a girlfriend?",
    "create_time": 1575961551,
    "source": "Alzheimers"
  },
  {
    "id": 36,
    "post_id": "e7430w",
    "url": "https://www.reddit.com/r/Alzheimers/comments/e7430w/grandfather_with_alzheimers_keeps_overfeeding_dog/",
    "text": "Hi,\nMy grandfather has Alzheimers, and lately, he's been overfeeding his dog to an alarming degree. The dog, Princess, is quite old and already very overweight. One single bag of treats is supposed to last at least a month and a half. Last week, he fed her two entire bags.\nMy grandmother has tried telling him that he can't do that, but he's just not understanding (which, of course, is not his fault). Hiding the treat bags won't do any good, as he'll just drive to the store and buy more on his own.\nPrincess isn't in the greatest health and we're all worried about the effects that my grandfather overfeeding her will have, but there isn't much we can do to stop him from doing it. Does anybody have any ideas as to how we should go about handling this?\nThank you",
    "author": "CrystalandtheGems",
    "title": "Grandfather with Alzheimers keeps overfeeding dog - what to do?",
    "create_time": 1575664233,
    "source": "Alzheimers"
  },
  {
    "id": 38,
    "post_id": "e56my8",
    "url": "https://www.reddit.com/r/Alzheimers/comments/e56my8/christmas_gift_advice/",
    "text": "Hi; my dad has early onset Alz (diagnosed at 56, 5 years ago) and is still in the moderate stages. Does anyone have suggestions for a simple toy or activity my family could give him for the holidays? He’s still very aware of/embarrassed by his forgetfulness and challenges so I want to find something that isn’t too obviously designed for children, like some of the Alz “toys” I’ve seen. We have an Alexa system for him to listen to music and podcasts, but he’s had a lot of nervous energy lately and needs something to do with his hands. Thanks in advance",
    "author": "smash96",
    "title": "Christmas Gift Advice",
    "create_time": 1575325247,
    "source": "Alzheimers"
  },
  {
    "id": 39,
    "post_id": "e4d4w9",
    "url": "https://www.reddit.com/r/Alzheimers/comments/e4d4w9/talking_with_my_grandpa_am_i_doing_the_right_thing/",
    "text": "He was diagnosed a few years ago and has progressively gotten worse, he would always talk about the old days but mix it up with some current events, now it seems he doesn't remember anything but the past.\nI talk with him daily and he repeats himself a lot, sometimes the same thing every 20 seconds for 5 minutes. \nWhen he does this I don't interject, I let him repeat himself. Is this the right thing to do? I feel like it is but I'm not sure.",
    "author": "realthroaway99",
    "title": "Talking with my Grandpa, am I doing the right thing?",
    "create_time": 1575185197,
    "source": "Alzheimers"
  },
  {
    "id": 42,
    "post_id": "e15d34",
    "url": "https://www.reddit.com/r/Alzheimers/comments/e15d34/mothers_recent_diagnosis/",
    "text": "My mother has been diagnosed with early onset Alzheimer's, and I know a lot about the disease, but nothing about how she is able to support herself while living with it in her later stages. If you guys don't mind, I'll list some of my questions below (we are in Ohio for reference).\n\n\nHow would she be able to support herself when she is no longer able to work? She has no retirement or savings, and disability will not let you file and make a livable wage at the same time. \n\n\nShe didn't recognize me for the first time while visiting. How could I help her from suffering through that scare again? \n\n\nWhat could I do to help her? The internet hasn't given me many options, if there are any.\n\n",
    "author": "randomdude025",
    "title": "Mother's recent diagnosis",
    "create_time": 1574632209,
    "source": "Alzheimers"
  },
  {
    "id": 45,
    "post_id": "dya95j",
    "url": "https://www.reddit.com/r/Alzheimers/comments/dya95j/bath/",
    "text": "Three generations of us can’t figure out how to convince my 86 year old great nana (late stage) to take a bath. She needs one in the worse way. She’s lived with us for months and has yet to take one. She’s getting smelly but either can’t smell anything or doesn’t care or doesn’t know that it’s her. She gets SO upset whenever we bring it up. It’s not like we can force her. Please... how can any of us convince her? Any ideas at all?",
    "author": "lakeKODAS",
    "title": "Bath?",
    "create_time": 1574114205,
    "source": "Alzheimers"
  },
  {
    "id": 48,
    "post_id": "dt6i26",
    "url": "https://www.reddit.com/r/Alzheimers/comments/dt6i26/activities_for_someone_with_early_alzheimers/",
    "text": "Late last year my boyfriend's mother was diagnosed with dementia. Early onset Alzheimer's runs in her family. She is still relatively with it, as she recognizes most people and can talk about her day.\nLast week she had a stroke. Her memory took a hit. She's having trouble recalling certain words and her delusions are worse. She still recognizes us, but it frustrates her when she doesn't remember details or who else visited her that day. She's still convinced she'll get better one day.\nShe's retired, but her husband is not, so she spends most days alone with a few people coming to check on her or give her medications. Boyfriend and I visit every other day to make sure she takes her pills and eats. She ideally needs 24/7 care, but it's not financially possible right now.\nShe told us that during the day, she has nothing to think about. She spends most of her time watching TV, and she's starting to have trouble remembering how to make it play what she wants. She used to be interested in arts and crafts, but it was always socially. I don't know if her fine motor skills are intact.\nI'm worried if she doesn't have anything to do she won't improve at all or she'll decline faster. I plan to cook with her next time we see her. She lit up when I suggested it and went to find some recipes. Otherwise I'm not sure what we could do. I really want something that encourages her mind to work.\nTDLR: if anyone has advice on activities we can give a woman with early onset Alzheimer's, to do alone or with us, it would be greatly appreciated. Or any advice at all on how to support my boyfriend and his family through this difficult time, resources, ect. Thanks in advance.",
    "author": "Comorbid_insomnia",
    "title": "Activities for someone with early Alzheimer's",
    "create_time": 1573169869,
    "source": "Alzheimers"
  },
  {
    "id": 50,
    "post_id": "dt34vo",
    "url": "https://www.reddit.com/r/Alzheimers/comments/dt34vo/driving_liability_and_dmv_drivers_test/",
    "text": "Hello all, \nMy father was asked by his neurologist to not drive any more this past August. He disagrees with this and feels his driving is fine. I’m on the fence. He scares me a bit, but I’ve definitely been with worse drivers. \nThe language in my dad’s after visit report says, “Please do not drive. If you’d like a formal drivers test, the DMV is free.”\nI have two questions:\n- I have heard that because he has this diagnosis and recommendation in his medical record, if he got in an accident, they could be sued and lose everything. Is this true? It would be a good argument for him to stop driving. \n\nHow do i get a DMV test scheduled? I’ve called, searched their website, stopped in. No one has any idea what I’m talking about. I want to schedule him for a drivers test to make sure he’s safe. They tell me he isn’t due for a test for a few years. (We live in Wisconsin)\n\nNote: he’s willing to take a DMV test. He wants to prove that he’s safe.",
    "author": "wittyexplore",
    "title": "Driving Liability and DMV drivers test",
    "create_time": 1573156216,
    "source": "Alzheimers"
  },
  {
    "id": 51,
    "post_id": "dsyokq",
    "url": "https://www.reddit.com/r/Alzheimers/comments/dsyokq/tips_for_taking_care_of_matted_hair_im_at_my_wits/",
    "text": "My MIL went to visit a relative for a few weeks so that partner and I could get respite. Unfortunately, her hair never got combed or brushed and is now matted. It's waist length and there are knots all the way up and at the base of her skull. I'm worried that this may be bad for her health, I don't want her getting a fungus under there. We tried soaking it with coconut oil last night and combing it, but we couldn't get all of the knots out and she refuses to help. She got quite agitated, threatened to hit us, and was yelling about it. I can't think of anything else but to cut the knots out, but I think this may mean using clippers on the back of her head. Her hair has been her pride and joy for her entire life and I don't want to take this from her, but I don't know what else to do, I think it will only get worse from here. \nAny tips, either on getting tangles out or how to go about cutting it? She's adamant that she won't have her hair cut.",
    "author": "chingu_not_gogi",
    "title": "Tips for taking care of matted hair? I'm at my wits end!",
    "create_time": 1573137883,
    "source": "Alzheimers"
  },
  {
    "id": 54,
    "post_id": "dsm3cl",
    "url": "https://www.reddit.com/r/Alzheimers/comments/dsm3cl/any_good_leg_workouts_for_late_stage_alz/",
    "text": "my mum, on 8th year of alz, is usually on the bed or wheelchair.she rarely walks and if she does, it requires multiple ppl. Are there any exercises to strengthen her legs or i should just aim to have her walk a little more each day?",
    "author": "anxietyokra",
    "title": "ANy good leg workouts for late stage alz",
    "create_time": 1573072401,
    "source": "Alzheimers"
  },
  {
    "id": 55,
    "post_id": "ds0ywy",
    "url": "https://www.reddit.com/r/Alzheimers/comments/ds0ywy/grandma_and_the_rise_of_technology/",
    "text": "Basically, my 84 year old grandmother is wearing my mother down. We live in the same house, which is split. My Grandma has a basic apartment to herself as she is still able to manage herself to a degree. Her memory for things has greatly declined, and yesterday she pretty much forgot who her eldest daughter was when my mother (second of 4 siblings) reminded my grandma. \nRegarding my post. She insists that she continues to have a phone. Demands a cell phone or a landline. We have gone through quite a few of each. A flip phone with basic tech to big buttoned land lines. She cannot grasp how technology works anymore. She comes out and gets angry, throws fits saying how she wants a land line \"you have a land line grandma\", how she doesn't understand after we explain it both verbally and in written form. We write extremely legible and simple instructions, that she never follows.\nAfter these confrontations my mom is in tears of frustration and sadness. There's more to my grandma's fading world, but right now my focus is on tech. Could anyone who has experienced similar suggest anything with a voice command option? has Alexa or an echo worked, something that requires no pushing of buttons as she has a light touch and claims to press buttons but ends up turning the phone off in the end. Any help would be greatly appreciated.",
    "author": "AyeYoReddit",
    "title": "Grandma and the rise of technology.",
    "create_time": 1572968814,
    "source": "Alzheimers"
  }
]