[
  {
    "question": "What is the earliest known case of Alzheimer's? ",
    "link": "https://www.quora.com/topic/Alzheimers-Biology-Research-in-Depth"
  },
  {
    "question": "Is the ICT protocol for reversing Alzheimer’s a scam? ",
    "link": "https://www.quora.com/topic/Alzheimers-Biology-Research-in-Depth"
  },
  {
    "question": "What do you think of Aducanumab being great news as the first possible treatment for Alzheimer’s? ",
    "link": "https://www.quora.com/topic/Alzheimers-Biology-Research-in-Depth"
  },
  {
    "question": "How does the potential Alzheimer’s treatment BAN2401 differ from Biogen's other anti-amyloid antibody aducanumab? ",
    "link": "https://www.quora.com/topic/Alzheimers-Biology-Research-in-Depth"
  },
  {
    "question": "What is Magnesium L-Threonate's promise for dementia treatment? ",
    "link": "https://www.quora.com/topic/Alzheimers-Biology-Research-in-Depth"
  },
  {
    "question": "Will a 40 Hz flashing light (or 40 Hz audio tone) help to prevent dementia? It seems to work with mice. ",
    "link": "https://www.quora.com/topic/Alzheimers-Biology-Research-in-Depth"
  },
  {
    "question": "What are the differences between Frontotemporal dementia (FTD) and Alzheimer's disease? ",
    "link": "https://www.quora.com/topic/Alzheimers-Biology-Research-in-Depth"
  },
  {
    "question": "In amyloidosis, why are the amyloid proteins deposited extracellularly rather than intracellularly? ",
    "link": "https://www.quora.com/topic/Alzheimers-Biology-Research-in-Depth"
  },
  {
    "question": "Will Biogen's reanalysis of aducanumab clinical trial data lead to other groups/companies reassessing their data from other failed AD drugs, and in turn, additional FDA filings? If so, will this affect current AD research not focused on amyloid? ",
    "link": "https://www.quora.com/topic/Alzheimers-Biology-Research-in-Depth"
  },
  {
    "question": "How promising is L-serine as a potential treatment for Alzheimer's or ALS? ",
    "link": "https://www.quora.com/topic/Alzheimers-Biology-Research-in-Depth"
  },
  {
    "question": "How plausible is the new model for the initiation of tau aggregation in Alzheimer's cited below? ",
    "link": "https://www.quora.com/topic/Alzheimers-Biology-Research-in-Depth"
  },
  {
    "question": "How much evidence is there for existence of non-fibrillar amyloid beta oligomers in vivo? Is there evidence for the existence of non-fibrillar oligomers of other amyloid proteins? ",
    "link": "https://www.quora.com/topic/Alzheimers-Biology-Research-in-Depth"
  }
]
